{"config": [{"config": {"arguments": {}, "output_shape": null, "output_shape_type": "raw", "function_type": "lambda", "batch_input_shape": [null, 160, 320, 3], "name": "lambda_1", "function": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwwAAAB8AABkAQAbZAIAGFMpA07p/wAAAGcAAAAAAADgP6kA\nKQHaAXhyAgAAAHICAAAA+jdDOi9Vc2Vycy9saW5taW5na3VuL0Rlc2t0b3AvQmVoYXZpb3JhbC1D\nbG9uaW5nL21vZGVsLnB52gg8bGFtYmRhPmkAAABzAAAAAA==\n", null, null], "trainable": true, "dtype": "float32"}, "class_name": "Lambda"}, {"config": {"data_format": "channels_last", "batch_input_shape": [null, 160, 320, 3], "name": "cropping2d_1", "cropping": [[50, 21], [0, 0]], "trainable": true, "dtype": "float32"}, "class_name": "Cropping2D"}, {"config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "kernel_size": [5, 5], "filters": 24, "name": "conv2d_1", "activity_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "kernel_size": [5, 5], "filters": 36, "name": "conv2d_2", "activity_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "kernel_size": [5, 5], "filters": 48, "name": "conv2d_3", "activity_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "kernel_size": [3, 3], "filters": 64, "name": "conv2d_4", "activity_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "kernel_size": [3, 3], "filters": 64, "name": "conv2d_5", "activity_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "seed": null, "rate": 0.5, "name": "dropout_1", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "activity_regularizer": null, "units": 1164, "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "activity_regularizer": null, "units": 100, "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "activity_regularizer": null, "units": 50, "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "activity_regularizer": null, "units": 10, "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "activity_regularizer": null, "units": 1, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.2.0", "backend": "tensorflow"}